---
kind: property
id: P:Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServerIds.DefaultPathOfTravelCalculationGUID
source: html/1abdb114-4582-ffc5-0a0c-bf3a1b30f8c2.htm
---
# Autodesk.Revit.DB.Analysis.PathOfTravelCalculationServerIds.DefaultPathOfTravelCalculationGUID Property

GUID to represent the default calculation server id.

## Syntax (C#)
```csharp
public static Guid DefaultPathOfTravelCalculationGUID { get; }
```